controllers/BukuController.php

    public function actionListBuku()
    {

        $model = KatalogBuku::find()->all();
---
SELECT * FROM `katalog_buku`

    public function actionCreateUpdateBuku($id = '')
    {
        // cek apakah ada id pada url jika ada maka update jika tidak ada create
        if ($id) {
            //untuk mengambil 1 record buku dengan id dari parameter
            $model = KatalogBuku::findOne($id);
            $title = 'Update Buku';
        } else {
            //new katalog buku = untuk membuat record baru pada tabel buku
            $model = new KatalogBuku();
            $title = 'Add Buku';
        }
        try {
            //cek apakah request post
            if ($model->load(Yii::$app->request->post())) {
                if (!$id) {
                    //jika create masukkan data created by dan status
                    // status = 1 artinya buku tersedia
                    $model->created_by = Yii::$app->user->id;
                    $model->status = 1;
                }
                if (!$model->save()) {
---
SELECT * FROM `katalog_buku` WHERE `id`='12'
INSERT INTO `katalog_buku` (`judul_buku`, `deskripsi_buku`, `penerbit`, `created_by`, `status`) VALUES ('Bumi Manusia', 'Buku Indonesia', 'D', 9, 1)