controllers/PeminjamController.php

SELECT * FROM `peminjam` WHERE `status`=1
---
    public function actionListPeminjam()
    {
        $model = Peminjam::find()->where(['status' => 1])->all();

INSERT INTO `peminjam` (`id_buku`, `id_admin`, `status`, `tanggal_pinjam`, `tanggal_kembali`) VALUES (12, 3, 1, '2024-01-07', '2024-01-14')
---
    public function actionCreatePeminjam()
    {
        // add new record pada tabel peminjam
        $model = new Peminjam();
        //akses function pada model katalog buku untuk mendapat
        //list buku dengan status 1 / tersedia
        $listBuku = KatalogBuku::getBook();
         //akses function pada model user untuk mendapat semua user
        $listAdmin = User::getUser();
        //mendapat tanggal hari ini dengan format tahun - bulan - tanggal
        $now = date('Y-m-d');
        // convert strtotime
        $convertedDate = strtotime($now);
        //diatambah 7 hari untuk mendapat end date
        $end =  strtotime("+7 day", $convertedDate);
        // convert format end date dengan format tahun-bulan-tanggal
        $convertedDateEnd = date('Y-m-d', $end);
        try {
            //cek apakah req post
            if ($model->load(Yii::$app->request->post())) {
                //set status 1 artinya peminjam aktif
                $model->status = 1;
                // set tanggal pinjam dengan tanggal hari ini
                $model->tanggal_pinjam = $now;
                // set tanggal kembali dengan tanggal hari ini + 7 hari
                $model->tanggal_kembali = $convertedDateEnd;
                if (!$model->save()) {