controllers/PengembalianController.php

    public function actionListPengembalian()
    {
        $model = Pengembalian::find()->all();
---
SELECT * FROM `pengembalian`

    public function actionCreatePengembalian()
    {

        try {
            // id_buku, peminjam, admin didapat dari data AJAX yang
            // dikirimkan ke action ini
            $id_buku = Yii::$app->request->post("id_buku");
            $id_peminjam = Yii::$app->request->post("id_peminjam");
            $id_admin = Yii::$app->request->post("id_admin");

            // create new record pada tabel pengembalian
            $model = new Pengembalian();
            //set id buku sesuai dengan variabel id buku diatas
            $model->id_buku = $id_buku;
            //set id peminjam sesuai dengan variabel id peminjam diatas
            $model->id_peminjam = $id_peminjam;
            //set id admin sesuai dengan variabel id admin diatas
            $model->id_admin = $id_admin;
            //set tanggal pengembalian -> tanggal hari data dimasukkan
            $model->tanggal_pengembalian = date('Y-m-d');


            if (!$model->save()) {
---
INSERT INTO `pengembalian` (`id_buku`, `id_peminjam`, `id_admin`, `tanggal_pengembalian`) VALUES (11, 20, 4, '2024-01-07')