controllers/SiteController.php

    public function actionDashboard()
    {
        //query buku dengan status 1 / tersedia lalu di dihitung dengn count
        $modelBuku = KatalogBuku::find()->where(['status' => 1])->all() ;
        $countBuku = count($modelBuku);
       //query buku dengan status 0 / dipinjam lalu di dihitung dengn count
        $modelBukuDipinjam = KatalogBuku::find()->where(['status' => 0])->all() ;
        $countBukuDipinjam = count($modelBukuDipinjam);
        //query peminjam dengan status 1  / peminjam lalu di dihitung dengn count
        $modelPeminjam = Peminjam::find()->where(['status' => 1])->all();
        $countModelPeminjam = count($modelPeminjam);
       //query pengembalian lalu di dihitung dengn count
        $modelPengembalian = Pengembalian::find()->all();
---
SELECT * FROM `katalog_buku` WHERE `status`=1
SELECT * FROM `katalog_buku` WHERE `status`=0
SELECT * FROM `peminjam` WHERE `status`=1
SELECT * FROM `pengembalian`