models/KatalogBuku.php

SELECT * FROM `katalog_buku` WHERE `status`=1
---
    public static function getBook()
    {
        // mengambil semua buku dengan status 1 / tersedia
        $models = KatalogBuku::find()->where(['status' => 1])->all();

SELECT * FROM `katalog_buku` WHERE `id`=4
---
    public static function getBookName($id)
    {
        // mengambil data buku dengan id tertentu
        $model = KatalogBuku::findOne($id);