models/Peminjam.php

SELECT * FROM `katalog_buku` WHERE `id`='12'
UPDATE `katalog_buku` SET `status`=0 WHERE `id`=12
---
    public static function updateBookStatus($id)
    {
        // fungsi untuk update status buku menjadi 0 atau tidak tesedia
        // mencari data buku dengan id tertentu
        $model = KatalogBuku::findOne($id);

        if ($model != null) {
            //set status jadi 0 / tidak tesedia
            $model->status = 0;
            if ($model->save()) {