models/Pengembalian.php

    public static function getTanggalKembali($id_peminjam)
    {
        // mengambil data peminjam dengan id tertentu
        $model = Peminjam::findOne($id_peminjam);
---
SELECT * FROM `peminjam` WHERE `id`=2

    public static function updateBookStatusActive($id)
    {
        // mengambil data buku dengan id tertentu
        $model = KatalogBuku::findOne($id);
        if ($model != null) {
            //update status 1 atau tersedia
            $model->status = 1;
            if ($model->save()) {
---
SELECT * FROM `katalog_buku` WHERE `id`='11'
UPDATE `katalog_buku` SET `status`=1 WHERE `id`=11

    public static function updatePeminjamStatus($id, $id_pengembalian)
    {
         // mengambil data peminjam dengan id tertentu
        $model = Peminjam::findOne($id);
        if ($model != null) {
            // update status 0 / peminjaman sudah selesai
            $model->status = 0;
            // update id pengembalian
            $model->id_pengembalian = $id_pengembalian;
            if ($model->save()) {
---
SELECT * FROM `peminjam` WHERE `id`='20'
UPDATE `peminjam` SET `status`=0, `id_pengembalian`=26 WHERE `id`=20