models/SignUpForm.php

INSERT INTO `User` (`username`, `password`, `access_token`, `auth_key`) VALUES ('michelle', '$2y$13$xoREap9ZQGtZjZm0BephZu/zUCzG2TfYPmpR/4loOrPcJ.8qtF/qi', 'cGbvAkHrQpInL5LrfBlOSXaT3CMXL91Z', 'wq9F3j0ppH5X6t7yVy8T9m5tMxtIL68t')
---
    public function signUp()
    {
        //new user record
        $user = new User();
        $user->username = $this->username;
        // menggunakan  yii app security untuk  generate hash password
        $user->password = \Yii::$app->security->generatePasswordHash($this->password);
        // menggunakan  yii app security untuk  generate access_token
        $user->access_token = \Yii::$app->security->generateRandomString();
                // menggunakan  yii app security untuk  generate auth_key
        $user->auth_key = \Yii::$app->security->generateRandomString();

        if ($user->save()) {