models/User.php

    public static function findIdentity($id)
    {
        return self::find()->where(['id' => $id])->one();
---
SELECT * FROM `User` WHERE `id`=9

    public static function getUser()
    {
        $models = User::find()->all();
---
SELECT * FROM `User`

    public static function findByUsername($username)
    {
        return self::findOne(['username' => $username]);
---
SELECT * FROM `User` WHERE `username`='michelle'

    public static function getUsername($id){
        $model = User::findOne($id);
---
SELECT * FROM `User` WHERE `id`=4